Array.from({length: 12}, (_, i) => `userP${i}`);
Array.from({length: 8}, (_, i) => `userY${i}`);
Array.from({length: 17}, (_, i) => `userH${i}`);
Array.from({length: 10}, (_, i) => `userC${i}`);
Array.from({length: 15}, (_, i) => `userZ${i}`);

export const mockInfoCards = [
    {
        id: 'info1', title: 'Що брати з собою?', iconName: 'Checkroom',
        content: `<ul><li>Зручний спортивний одяг та взуття.</li><li>Рушник (один для тренажерів, інший для душу).</li><li>Пляшка для води (у нас є кулери).</li><li>За бажанням: рукавички, особистий килимок.</li><li>Гарний настрій та мотивацію!</li></ul>`
    },
    {
        id: 'info2', title: 'Правила Залу GRINDZONE', iconName: 'RuleFolder',
        content: `<p>Для комфорту та безпеки всіх відвідувачів:</p><ul><li>Використовуйте рушник на тренажерах.</li><li>Повертайте інвентар на місце.</li><li>Не кидайте важкі предмети.</li><li>Дотримуйтесь чистоти.</li><li>Заборонено тренуватися у вуличному взутті.</li><li>Поважайте інших.</li></ul><p>Повний список правил доступний на рецепції.</p>`
    },
    {
        id: 'info3', title: 'Безпека та Інструктаж', iconName: 'Devices',
        content: `<p>На кожному тренажері є QR-код до відео-інструкції. Якщо виникають питання, зверніться до чергового тренера.</p><p>Не соромтеся запитувати – ваша безпека та ефективність тренувань для нас пріоритет.</p>`
    },
];